update logging and readme
